-- Дізнатися, який офіціант оформив найбільше замовлень за конкретний період.
SELECT TOP 1 tab_num, surname, first_name, COUNT(orders.unique_num) AS n_orders
FROM workers INNER JOIN orders ON workers.tab_num = orders.tab_num
WHERE position = 'офіціант'
      AND fire_date IS NULL
      AND order_time <= '2017-01-01'
      AND order_time >= '2001-01-01'
GROUP BY workers.tab_num
ORDER BY n_orders;

-- Дізнатися, який офіціант приніс найбільше прибутку за конкретний період.
SELECT TOP 1 tab_num, surname, first_name, SUM(cost) AS total
FROM workers INNER JOIN orders ON workers.tab_num = orders.tab_num
WHERE     position = 'офіціант'
      AND fire_date IS NULL
      AND order_time <= '2017-01-01'
      AND order_time >= '2001-01-01'
GROUP BY workers.tab_num
ORDER BY total;

-- Обрахувати витрати за поставки за конкретний період.
SELECT SUM(cost) AS total
FROM deliveries
WHERE     pay_date <= '2017-01-01'
      AND pay_date >= '2017-01-01';

-- Обрахувати дохід від замовлень за конкретний період.
SELECT SUM(cost) AS total
FROM orders
WHERE     order_time <= '2017-01-01'
      AND order_time >= '2017-01-01';

-- Обрахувати ціну страв з певною націнкою.
CREATE VIEW avg_ing_prices(ing_name, unit_price) AS
SELECT ing_name, AVG(unit_price * graduation_rule) AS unit_price
FROM goods INNER JOIN units ON goods.unit_name = units.unit_name
GROUP BY ing_name;

SELECT tech_card_num, dish_name, (SELECT SUM(unit_price * amount)
                                  FROM dishes_ingredients INNER JOIN avg_ing_prices
                                       ON dishes_ingredients.ing_name = avg_ing_prices.ing_name
                                  WHERE X.tech_card_num = tech_card_num)
FROM dishes X;

-- Оновити кількість продуктів на складі.


-- Отримати Z-звіт (відомості про дохід наприкінці дня). 
-- Отримати відомості про наявність ігредієнтів на складі для конкретної страви. 
-- Отримати відомості про наявність конкретного інгредієнту на складі. 
-- Отримати відомості про продажі за певною категорією страв (кількість замовлених порцій) за період. 
-- Отримати відомості про продажі конкретної страви (кількість замовлених порцій). 
-- Отримати інформацію про поточні замовлення. 
-- Отримати інформацію про поточні свої замовлення.
-- Отримати кількість оформлених чеків (замовлень) за конкретний період. 
-- Отримати поточне меню. 
-- Отримати перелік та кількість необхідних страв всіх поточних замовлень для кухні. 
-- Отримати середнє перебування клієнта у кафе за конкретний період. 
-- Отримати середнє перебування клієнта у кафе. 
-- Отримати середню вартість чека за конкретний період.
-- Отримати середню вартість чека на людину за конкретний період. 
-- Отримати поточний список офіціантів/барменів/кухарів. 
-- Отримати список оформлених чеків (замовлень) за конкретний період конкретним офіціантом/барменом. 
-- Отримати список постачальників, котрі поставляли певний інгредієнт.
-- Отримати список страв, котрі були замовлені менше/більше n разів за конкретний період. 
-- Отримати список страв, котрі були замовлені менше/більше n разів. 
-- Отримати страви за категорією. 
-- Отримати Х-звіт (відомості про дохід за день в будь-який момент). 
-- Переглянути замовлення за конкретний період. 
-- Переглянути інформацію про поставки за конкретний період. 
-- Переглянути інформацію про поточні поставки (ті, що не доставили або не заплатили). 
-- Сформувати «стоп-список» (див. п. 1.2.1 абзац 4) 
-- Сформувати «топ-список» страв з першими n інгредієнтами, що скоро зіпсуються (див. п. 1.2.1 абзац 4) 
